Учет_документов_20_Develop.ДокументыИТорги/src/Documents/РасшДТ_ОтправкаПочты/РасшДТ_ОтправкаПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасшДТ_ОтправкаПочты</name>
  <registerRecords>InformationRegister.РасшДТ_ДоставкаДокументовКурьером</registerRecords>
  <attributes>
    <name>НеИзрасходованныеСредстваИзПредыдущегоОтчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоНаПочтовыеРасходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияСредств</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПотраченоНаПочтовыеРасходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсталосьПотратитьНаПочтовыеРасходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмаОтправил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИнформацияООтправленныхДокументах</name>
    <attributes>
      <name>ДатаОтправкиПисьма</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолучательДокументов</name>
      <type>
        <types>CatalogRef.РасшДТ_Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписьСодержимогоКонверта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДляОтслеживания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучениеДенег</name>
    <attributes>
      <name>ДатаПолученияДенег</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолученнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_документов_20_Develop.ДокументыИТорги/src/InformationRegisters/РасшДТ_ДоставкаДокументовКурьером/РасшДТ_ДоставкаДокументовКурьером.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасшДТ_ДоставкаДокументовКурьером</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолучательДокументов</name>
    <type>
      <types>CatalogRef.РасшДТ_Клиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_документов_20_Develop.ДокументыИТорги/src/Documents/РасшДТ_ОтправкаПочты/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии GNU GENERAL PUBLIC LICENSE
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ,Режим)
	
	ЭтотОбъект.ПотраченоНаПочтовыеРасходы = ИнформацияООтправленныхДокументах.Итог("Сумма");
	
	ЭтотОбъект.ОсталосьПотратитьНаПочтовыеРасходы = ЭтотОбъект.НеИзрасходованныеСредстваИзПредыдущегоОтчета + ЭтотОбъект.ПолученоНаПочтовыеРасходы - ЭтотОбъект.ПотраченоНаПочтовыеРасходы;
	

	// регистр РасшДТ_ДоставкаДокументовКурьером
	Движения.РасшДТ_ДоставкаДокументовКурьером.Записывать = Истина;
	Для Каждого ТекСтрокаИнформацияООтправленныхДокументах из ИнформацияООтправленныхДокументах Цикл
		Движение = Движения.РасшДТ_ДоставкаДокументовКурьером.Добавить();
		Движение.Период = Дата;
		Движение.АвторДокумента = ПисьмаОтправил;
		Движение.Дата = ТекСтрокаИнформацияООтправленныхДокументах.ДатаОтправкиПисьма;
		Движение.ПолучательДокументов = ТекСтрокаИнформацияООтправленныхДокументах.ПолучательДокументов;
		Движение.Наименование = ТекСтрокаИнформацияООтправленныхДокументах.ОписьСодержимогоКонверта;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
